package Task1;

import java.util.List;
import java.util.Random;

public class Main {
    public static void main(String[] args) throws InterruptedException {
        Random random = new Random();

        final List<String> Words = List.of("кот", "собака", "слон", "жираф", "пингвин", "кенгуру", "медведь", "лев", "зебра", "дельфин",
                "яблоко", "апельсин", "пицца", "мороженое", "кофе", "чай", "торт", "салат", "суп", "бургер",
                "телефон", "компьютер", "книга", "ручка", "карандаш", "рюкзак", "часы", "зеркало", "лампа", "стул",
                "дерево", "цветок", "трава", "облако", "дождь", "солнце", "луна", "звезда", "река", "гора",
                "врач", "учитель", "повар", "художник", "музыкант", "строитель", "продавец", "водитель", "парикмахер", "программист",
                "футбол", "баскетбол", "теннис", "плавание", "бег", "йога", "гимнастика", "шахматы", "волейбол", "хоккей",
                "картина", "музыка", "театр", "танец", "поэзия", "скульптура", "кино", "фотография", "балет", "опера",
                "физика", "химия", "биология", "математика", "география", "история", "астрономия", "экология", "психология", "философия",
                "автомобиль", "самолет", "поезд", "велосипед", "принтер", "телевизор", "холодильник", "микроволновка", "пылесос", "утюг",
                "игра", "фильм", "концерт", "парк", "музей", "цирк", "зоопарк", "фестиваль", "выставка", "праздник");
        final String CURRENTWORDS = Words.get(random.nextInt(Words.size())).toLowerCase();

        System.out.println("Добро пожаловать в игру Виселица!");

        Game game = new Game(CURRENTWORDS);
        game.start();
    }
}